# data frames

In [1]:
import numpy as np
import pandas as pd

### creating data frames

In [5]:
data = {
    'Name' : ['anu', 'tashu', 'mona', 'anshu', 'aayu'],
    'Age' : [21, 20, 22, 15, 23],
     'city' : ['dehri', 'bhopal', 'london', 'mumbai', 'delhi'],
      'salary' : [476452, 21454, 68738665, 8976700,556688]

    
}
pd.DataFrame(data)

    Name  Age    city    salary
0    anu   21   dehri    476452
1  tashu   20  bhopal     21454
2   mona   22  london  68738665
3  anshu   15  mumbai   8976700
4   aayu   23   delhi    556688

In [14]:
data_list = [
    ['anu', 21,	'dehri',476452],
    ['tashu', 20, 'bhopal',	21454],
	['mona', 22,	'london',	68738665],
	['anshu', 15, 'mumbai',	8976700],
	['aayu', 23, 'delhi', 556688 ]
]
df2 = pd.DataFrame(data_list)
columns = ["name", "age", "city", "salary"]
df2 = pd.DataFrame(data_list, columns =columns)
df2

    name  age    city    salary
0    anu   21   dehri    476452
1  tashu   20  bhopal     21454
2   mona   22  london  68738665
3  anshu   15  mumbai   8976700
4   aayu   23   delhi    556688

In [13]:
df2

       0   1       2         3
0    anu  21   dehri    476452
1  tashu  20  bhopal     21454
2   mona  22  london  68738665
3  anshu  15  mumbai   8976700
4   aayu  23   delhi    556688

In [16]:
df2['name']

0      anu
1    tashu
2     mona
3    anshu
4     aayu
Name: name, dtype: object

In [17]:
df2[["city", "age"]]

     city  age
0   dehri   21
1  bhopal   20
2  london   22
3  mumbai   15
4   delhi   23

In [20]:
df2["desigantion"] = ["doctor", "engineer", "lawyer","artist", "engineer"]

In [21]:
df2

    name  age    city    salary desigantion
0    anu   21   dehri    476452      doctor
1  tashu   20  bhopal     21454    engineer
2   mona   22  london  68738665      lawyer
3  anshu   15  mumbai   8976700      artist
4   aayu   23   delhi    556688    engineer

## remove column

In [28]:
df2.drop('desigantion',axis = 1)

    name  age    city    salary
0    anu   21   dehri    476452
1  tashu   20  bhopal     21454
2   mona   22  london  68738665
3  anshu   15  mumbai   8976700
4   aayu   23   delhi    556688

In [29]:
 df2.loc[[0,1]]

    name  age    city  salary desigantion
0    anu   21   dehri  476452      doctor
1  tashu   20  bhopal   21454    engineer

### selecting rows and column

In [31]:
df2.loc[[0,1]]

    name  age    city  salary desigantion
0    anu   21   dehri  476452      doctor
1  tashu   20  bhopal   21454    engineer

In [33]:
df2.iloc[[3]]

    name  age    city   salary desigantion
3  anshu   15  mumbai  8976700      artist

In [35]:
df2.loc[[0,1]] [["city","salary"]]

     city  salary
0   dehri  476452
1  bhopal   21454

### conditional selection

In [36]:
df2[df2["age"] > 21]

   name  age    city    salary desigantion
2  mona   22  london  68738665      lawyer
4  aayu   23   delhi    556688    engineer

In [37]:
#I only want to see those people whose age is above 21 and their city must be delhi

In [40]:
df2[(df2["age"] > 21) & (df2["city"] == 'delhi')]

   name  age   city  salary desigantion
4  aayu   23  delhi  556688    engineer